TODO.org
#+TODO: TODO(t) CURRENT(c@) WAIT(w@/!) | DONE(d@/!) CANCELED(c@)
#+LAST_MOBILE_CHANGE: 2014-01-23 11:32:56

2017
* Daily
** CURRENT Put color into Masa dataset
   - State "CURRENT"    from "TODO"       [2017-04-02 Sun 16:57] \\
     Ther are many documetns that show the color. What I will do now is simply take
     one file and try to fill in the color
** TODO [#A] Search for house insurance
** TODO [#A] Get the documents filled out properly for Mortgage source
** TODO [#A] Send Anju signature to Mortgage source
** TODO [#A] Mortgage Source schedule evaluation
** TODO Wait for the responce from seller about objection document
** TODO [#B] Complete Tax Documents
** TODO Put dishes back in closet
** TODO Fold the clothes
** TODO [#A] Time Management
** TODO [#B] Schedule meeting with Dimitri and team
** TODO [#C] Schedule meeting with Masa and team
** TODO [#A] Talk to the lady in computer science and get admission process
** TODO [#B] Collect course work
** TODO Setup Tracking on all master nodes
** TODO Load the larger masa dataset into the software and test
** TODO Make VTK VRUI work in CAVE and tiled wall
** TODO Ask Jared for minutes of last meeting
** TODO Talk to EJ about training and Indian thing on time
** TODO Work on using google one to synchronize between documents
** TODO Transfer money from chase to uniwyo
** TODO Transfer money to Mariwati
* April
** Soft Skills
