TODO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-03 Mon 02:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="nshetty" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline25">1. Daily</a>
<ul>
<li><a href="#orgheadline1">1.1. <span class="done DONE">DONE</span> Send Amy the videos of Collaboration</a></li>
<li><a href="#orgheadline2">1.2. <span class="todo CURRENT">CURRENT</span> Put color into Masa dataset</a></li>
<li><a href="#orgheadline3">1.3. <span class="todo TODO">TODO</span> Search for house insurance</a></li>
<li><a href="#orgheadline4">1.4. <span class="todo TODO">TODO</span> Get the documents filled out properly for Mortgage source</a></li>
<li><a href="#orgheadline5">1.5. <span class="todo TODO">TODO</span> Send Anju signature to Mortgage source</a></li>
<li><a href="#orgheadline6">1.6. <span class="todo TODO">TODO</span> Mortgage Source schedule evaluation</a></li>
<li><a href="#orgheadline7">1.7. <span class="todo TODO">TODO</span> Wait for the responce from seller about objection document</a></li>
<li><a href="#orgheadline8">1.8. <span class="todo TODO">TODO</span> Complete Tax Documents</a></li>
<li><a href="#orgheadline9">1.9. <span class="todo TODO">TODO</span> Put dishes back in closet</a></li>
<li><a href="#orgheadline10">1.10. <span class="todo TODO">TODO</span> Put clothes in drier</a></li>
<li><a href="#orgheadline11">1.11. <span class="todo TODO">TODO</span> Fold the clothes</a></li>
<li><a href="#orgheadline12">1.12. <span class="todo TODO">TODO</span> Time Management</a></li>
<li><a href="#orgheadline13">1.13. <span class="done DONE">DONE</span> Team work</a></li>
<li><a href="#orgheadline14">1.14. <span class="todo TODO">TODO</span> Schedule meeting with Dimitri and team</a></li>
<li><a href="#orgheadline15">1.15. <span class="todo TODO">TODO</span> Schedule meeting with Masa and team</a></li>
<li><a href="#orgheadline16">1.16. <span class="todo TODO">TODO</span> Talk to the lady in computer science and get admission process</a></li>
<li><a href="#orgheadline17">1.17. <span class="todo TODO">TODO</span> Collect course work</a></li>
<li><a href="#orgheadline18">1.18. <span class="todo TODO">TODO</span> Setup Tracking on all master nodes</a></li>
<li><a href="#orgheadline19">1.19. <span class="todo TODO">TODO</span> Load the larger masa dataset into the software and test</a></li>
<li><a href="#orgheadline20">1.20. <span class="todo TODO">TODO</span> Make VTK VRUI work in CAVE and tiled wall</a></li>
<li><a href="#orgheadline21">1.21. <span class="todo TODO">TODO</span> Submit time sheet</a></li>
<li><a href="#orgheadline22">1.22. <span class="todo TODO">TODO</span> Ask Jared for minutes of last meeting</a></li>
<li><a href="#orgheadline23">1.23. <span class="todo TODO">TODO</span> Talk to EJ about training and Indian thing on time</a></li>
<li><a href="#orgheadline24">1.24. <span class="todo TODO">TODO</span> setup org-mobile-todo mode</a></li>
</ul>
</li>
<li><a href="#orgheadline38">2. April</a>
<ul>
<li><a href="#orgheadline26">2.1. Soft Skills</a></li>
<li><a href="#orgheadline27">2.2. PhD Admission</a></li>
<li><a href="#orgheadline28">2.3. VueNix</a></li>
<li><a href="#orgheadline32">2.4. House Purchase</a>
<ul>
<li><a href="#orgheadline29">2.4.1. <span class="done DONE">DONE</span> Get the signature of Anju for bank document</a></li>
<li><a href="#orgheadline30">2.4.2. <span class="done DONE">DONE</span> House Inspectino</a></li>
<li><a href="#orgheadline31">2.4.3. <span class="done DONE">DONE</span> Sign the objection document</a></li>
</ul>
</li>
<li><a href="#orgheadline37">2.5. HOME</a>
<ul>
<li><a href="#orgheadline33">2.5.1. <span class="done DONE">DONE</span> Clean and throw out garbage</a></li>
<li><a href="#orgheadline34">2.5.2. <span class="done DONE">DONE</span> Put the shoes back in closet</a></li>
<li><a href="#orgheadline35">2.5.3. <span class="done DONE">DONE</span> Put clothes for wash</a></li>
<li><a href="#orgheadline36">2.5.4. <span class="done DONE">DONE</span> Wash the dishes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline45">3. March</a>
<ul>
<li><a href="#orgheadline42">3.1. <span class="done DONE">DONE</span> VueNix</a>
<ul>
<li><a href="#orgheadline39">3.1.1. <span class="done DONE">DONE</span> Configure Tiled Walls</a></li>
<li><a href="#orgheadline40">3.1.2. <span class="done DONE">DONE</span> Setup PetaLibrary</a></li>
<li><a href="#orgheadline41">3.1.3. <span class="done DONE">DONE</span> Setup the Configuration  on  diplayc</a></li>
</ul>
</li>
<li><a href="#orgheadline44">3.2. <span class="done DONE">DONE</span> Performance document</a>
<ul>
<li><a href="#orgheadline43">3.2.1. <span class="done DONE">DONE</span> Stress</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline53">4. FEB</a>
<ul>
<li><a href="#orgheadline46">4.1. <span class="todo TODO">TODO</span> send the document to EJ about grant</a></li>
<li><a href="#orgheadline47">4.2. <span class="todo TODO">TODO</span> make schedule for guitar everyday</a></li>
<li><a href="#orgheadline48">4.3. <span class="todo TODO">TODO</span> make schedule for painting everyday</a></li>
<li><a href="#orgheadline49">4.4. <span class="done DONE">DONE</span> Meet Katie and discuss meditation and her life</a></li>
<li><a href="#orgheadline50">4.5. Contact the committee personally and setup meeting</a></li>
<li><a href="#orgheadline51">4.6. Replace vtkMolecule with own class</a></li>
<li><a href="#orgheadline52">4.7. Replace vtkCMLMoleculeReader with own class</a></li>
</ul>
</li>
<li><a href="#orgheadline66">5. March</a>
<ul>
<li><a href="#orgheadline54">5.1. <span class="done DONE">DONE</span> Proctered VR class exam for Amy Banic</a></li>
<li><a href="#orgheadline55">5.2. <span class="done DONE">DONE</span> Help Grant Bowman with bringing in data</a></li>
<li><a href="#orgheadline56">5.3. <span class="done DONE">DONE</span> Check with Amy about class coming in</a></li>
<li><a href="#orgheadline57">5.4. <span class="done DONE">DONE</span> Get the tution waiver for Mobile Computing</a></li>
<li><a href="#orgheadline58">5.5. <span class="todo TODO">TODO</span> VRPN-client for common lisp</a></li>
<li><a href="#orgheadline59">5.6. <span class="done DONE">DONE</span> Introduce Masa masters thesis to CFD group</a></li>
<li><a href="#orgheadline60">5.7. <span class="done DONE">DONE</span> Get CFD group to use tech viz</a></li>
<li><a href="#orgheadline61">5.8. <span class="todo TODO">TODO</span> Write CEPL for CAVE</a></li>
<li><a href="#orgheadline62">5.9. <span class="todo TODO">TODO</span> Compile latest CEPL on mac</a></li>
<li><a href="#orgheadline63">5.10. <span class="todo WAIT">WAIT</span> Get a working DEVIL library on mac</a></li>
<li><a href="#orgheadline64">5.11. <span class="done DONE">DONE</span> Get rid of additional tution fees</a></li>
<li><a href="#orgheadline65">5.12. <span class="done DONE">DONE</span> Set up meeting with Carrie</a></li>
</ul>
</li>
<li><a href="#orgheadline67">6. <span class="todo WAIT">WAIT</span> Make a simple swig flag to generate packages</a></li>
<li><a href="#orgheadline68">7. <span class="todo TODO">TODO</span> Make asdf file and write to it</a></li>
<li><a href="#orgheadline69">8. <span class="todo TODO">TODO</span> Make package file and write to it</a></li>
<li><a href="#orgheadline70">9. <span class="todo TODO">TODO</span> Make library file and write to is</a></li>
<li><a href="#orgheadline71">10. <span class="todo TODO">TODO</span> Commit swig package generation to swig project</a></li>
<li><a href="#orgheadline76">11. April</a>
<ul>
<li><a href="#orgheadline72">11.1. </a></li>
<li><a href="#orgheadline73">11.2. <span class="todo WAIT">WAIT</span> DONE name vote</a></li>
<li><a href="#orgheadline74">11.3. <span class="done CANCELED">CANCELED</span> Install rifts in the touch screens</a></li>
<li><a href="#orgheadline75">11.4. <span class="todo WAIT">WAIT</span> Request quote for Middle VR.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
2017
</p>
