TODO.org
** DONE Introduce Masa masters thesis to CFD group
   - State "DONE"       from "WAIT"       [2016-04-05 Tue 19:07] \\
     They didnt seem to want that. They were looking for higherdimentional
     plotting. Volume rendering seems to be more accurate for that.
   - State "WAIT"       from "CURRENT"    [2016-03-24 Thu 14:08] \\
     Waiting for a response from Matt
   - State "CURRENT"    from "TODO"       [2016-03-24 Thu 14:07] \\
     The cdf group had asked if I can do some data assimilation for them. I think
     masa has already done something wrt this and I send them his work.
** DONE Get CFD group to use tech viz
   - State "DONE"       from "WAIT"       [2016-03-30 Wed 11:48] \\
     Asked Josh to set up time with Matt for FV test
   - State "WAIT"       from "CURRENT"    [2016-03-24 Thu 14:09] \\
     Wrote email to Matt and waiting for response
** TODO Write CEPL for CAVE
** TODO Compile latest CEPL on mac
** WAIT Get a working DEVIL library on mac
   - State "WAIT"       from "CURRENT"    [2016-03-30 Wed 12:38] \\
     This seems to a huge problem with brew. I might have to do this by myself. The
     idea will be to build everything from scratch
   - State "WAIT"       from "CURRENT"    [2016-03-30 Wed 11:56] \\
     Error opening shared object "/usr/local/Cellar/devil/1.7.8_1/lib/libIL.dylib":
       dlopen(/usr/local/Cellar/devil/1.7.8_1/lib/libIL.dylib, 10): Symbol not found: _png_set_gray_1_2_4_to_8
       Referenced from: /usr/local/Cellar/devil/1.7.8_1/lib/libIL.dylib
       Expected in: dynamic lookup
   - State "WAIT"       from "CURRENT"    [2016-03-30 Wed 11:50] \\
     Waiting to see if Cepl works
   - State "CURRENT"    from "TODO"       [2016-03-30 Wed 11:49] \\
     I simply uninstalled and reinstalled and it seems to have installed. Lets test
     and see if cepl actually works

** DONE Get rid of additional tution fees
   - State "DONE"       from "WAIT"       [2016-03-30 Wed 12:39] \\
     The tution is paid
** DONE Set up meeting with Carrie
   - State "DONE"       from "WAIT"       [2016-03-30 Wed 12:39] \\
     Meeting is set for Monday April 4 10:30
   - State "CURRENT"    from "TODO"       [2016-03-30 Wed 12:04] \\
     This is posponed to next week cause she is busy this week
   - State "WAIT"       from "CURRENT"    [2016-03-30 Wed 11:58] \\
     Sent email waiting for response
   - State "CURRENT"    from "TODO"       [2016-03-30 Wed 11:58] \\
     need to get paperwork filed
* WAIT Make a simple swig flag to generate packages
  - State "WAIT"       from "CURRENT"    [2016-03-04 Fri 15:33] \\
    Waiting to first get vrpn working without the need for swig
  - State "CURRENT"    from "TODO"       [2016-03-04 Fri 15:09] \\
    Writing swig module to autogenerate packages
* TODO Make asdf file and write to it
* TODO Make package file and write to it
* TODO Make library file and write to is
* TODO Commit swig package generation to swig project
  :PROPERTIES:
  :ID:       ef2af037-440a-4493-88c4-bb90827be31c
  :END:
  


* April
** 
** WAIT DONE name vote
   - State "WAIT"       from "CURRENT"    [2016-04-08 Fri 10:54] \\
     Waiting for responses
   - State "CURRENT"    from "TODO"       [2016-04-08 Fri 10:54] \\
     Send people to vote on names
** CANCELED Install rifts in the touch screens
** WAIT Request quote for Middle VR.
   - State "WAIT"       from "CURRENT"    [2016-04-08 Fri 11:06] \\
     waiting on a response
   - State "CURRENT"    from "TODO"       [2016-04-08 Fri 11:06] \\
     Send email to sebastien for an updated quote
