TODO.html
<div id="outline-container-orgheadline59" class="outline-3">
<h3 id="orgheadline59"><span class="section-number-3">5.6</span> <span class="done DONE">DONE</span> Introduce Masa masters thesis to CFD group</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>State "DONE"       from "WAIT"       <span class="timestamp-wrapper"><span class="timestamp">[2016-04-05 Tue 19:07] </span></span> <br  />
They didnt seem to want that. They were looking for higherdimentional
plotting. Volume rendering seems to be more accurate for that.</li>
<li>State "WAIT"       from "CURRENT"    <span class="timestamp-wrapper"><span class="timestamp">[2016-03-24 Thu 14:08] </span></span> <br  />
Waiting for a response from Matt</li>
<li>State "CURRENT"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2016-03-24 Thu 14:07] </span></span> <br  />
The cdf group had asked if I can do some data assimilation for them. I think
masa has already done something wrt this and I send them his work.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline60" class="outline-3">
<h3 id="orgheadline60"><span class="section-number-3">5.7</span> <span class="done DONE">DONE</span> Get CFD group to use tech viz</h3>
<div class="outline-text-3" id="text-5-7">
<ul class="org-ul">
<li>State "DONE"       from "WAIT"       <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 11:48] </span></span> <br  />
Asked Josh to set up time with Matt for FV test</li>
<li>State "WAIT"       from "CURRENT"    <span class="timestamp-wrapper"><span class="timestamp">[2016-03-24 Thu 14:09] </span></span> <br  />
Wrote email to Matt and waiting for response</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline61" class="outline-3">
<h3 id="orgheadline61"><span class="section-number-3">5.8</span> <span class="todo TODO">TODO</span> Write CEPL for CAVE</h3>
</div>
<div id="outline-container-orgheadline62" class="outline-3">
<h3 id="orgheadline62"><span class="section-number-3">5.9</span> <span class="todo TODO">TODO</span> Compile latest CEPL on mac</h3>
</div>
<div id="outline-container-orgheadline63" class="outline-3">
<h3 id="orgheadline63"><span class="section-number-3">5.10</span> <span class="todo WAIT">WAIT</span> Get a working DEVIL library on mac</h3>
<div class="outline-text-3" id="text-5-10">
<ul class="org-ul">
<li>State "WAIT"       from "CURRENT"    <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 12:38] </span></span> <br  />
This seems to a huge problem with brew. I might have to do this by myself. The
idea will be to build everything from scratch</li>
<li>State "WAIT"       from "CURRENT"    <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 11:56] </span></span> <br  />
Error opening shared object "/usr/local/Cellar/devil/1.7.8<sub>1</sub>/lib/libIL.dylib":
  dlopen(/usr/local/Cellar/devil/1.7.8<sub>1</sub>/lib/libIL.dylib, 10): Symbol not found: _png<sub>set</sub><sub>gray</sub><sub>1</sub><sub>2</sub><sub>4</sub><sub>to</sub><sub>8</sub>
  Referenced from: /usr/local/Cellar/devil/1.7.8<sub>1</sub>/lib/libIL.dylib
  Expected in: dynamic lookup</li>
<li>State "WAIT"       from "CURRENT"    <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 11:50] </span></span> <br  />
Waiting to see if Cepl works</li>
<li>State "CURRENT"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 11:49] </span></span> <br  />
I simply uninstalled and reinstalled and it seems to have installed. Lets test
and see if cepl actually works</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline64" class="outline-3">
<h3 id="orgheadline64"><span class="section-number-3">5.11</span> <span class="done DONE">DONE</span> Get rid of additional tution fees</h3>
<div class="outline-text-3" id="text-5-11">
<ul class="org-ul">
<li>State "DONE"       from "WAIT"       <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 12:39] </span></span> <br  />
The tution is paid</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline65" class="outline-3">
<h3 id="orgheadline65"><span class="section-number-3">5.12</span> <span class="done DONE">DONE</span> Set up meeting with Carrie</h3>
<div class="outline-text-3" id="text-5-12">
<ul class="org-ul">
<li>State "DONE"       from "WAIT"       <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 12:39] </span></span> <br  />
Meeting is set for Monday April 4 10:30</li>
<li>State "CURRENT"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 12:04] </span></span> <br  />
This is posponed to next week cause she is busy this week</li>
<li>State "WAIT"       from "CURRENT"    <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 11:58] </span></span> <br  />
Sent email waiting for response</li>
<li>State "CURRENT"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2016-03-30 Wed 11:58] </span></span> <br  />
need to get paperwork filed</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline67" class="outline-2">
<h2 id="orgheadline67"><span class="section-number-2">6</span> <span class="todo WAIT">WAIT</span> Make a simple swig flag to generate packages</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>State "WAIT"       from "CURRENT"    <span class="timestamp-wrapper"><span class="timestamp">[2016-03-04 Fri 15:33] </span></span> <br  />
Waiting to first get vrpn working without the need for swig</li>
<li>State "CURRENT"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2016-03-04 Fri 15:09] </span></span> <br  />
Writing swig module to autogenerate packages</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline68" class="outline-2">
<h2 id="orgheadline68"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Make asdf file and write to it</h2>
</div>
<div id="outline-container-orgheadline69" class="outline-2">
<h2 id="orgheadline69"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> Make package file and write to it</h2>
</div>
<div id="outline-container-orgheadline70" class="outline-2">
<h2 id="orgheadline70"><span class="section-number-2">9</span> <span class="todo TODO">TODO</span> Make library file and write to is</h2>
</div>
<div id="outline-container-orgheadline71" class="outline-2">
<h2 id="orgheadline71"><a id="ID-ef2af037-440a-4493-88c4-bb90827be31c"></a><span class="section-number-2">10</span> <span class="todo TODO">TODO</span> Commit swig package generation to swig project</h2>
<div class="outline-text-2" id="text-10">
</div>
</div>



<div id="outline-container-orgheadline76" class="outline-2">
<h2 id="orgheadline76"><span class="section-number-2">11</span> April</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-orgheadline72" class="outline-3">
<h3 id="orgheadline72"><span class="section-number-3">11.1</span> </h3>
</div>
<div id="outline-container-orgheadline73" class="outline-3">
<h3 id="orgheadline73"><span class="section-number-3">11.2</span> <span class="todo WAIT">WAIT</span> DONE name vote</h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>State "WAIT"       from "CURRENT"    <span class="timestamp-wrapper"><span class="timestamp">[2016-04-08 Fri 10:54] </span></span> <br  />
Waiting for responses</li>
<li>State "CURRENT"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2016-04-08 Fri 10:54] </span></span> <br  />
Send people to vote on names</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline74" class="outline-3">
<h3 id="orgheadline74"><span class="section-number-3">11.3</span> <span class="done CANCELED">CANCELED</span> Install rifts in the touch screens</h3>
</div>
<div id="outline-container-orgheadline75" class="outline-3">
<h3 id="orgheadline75"><span class="section-number-3">11.4</span> <span class="todo WAIT">WAIT</span> Request quote for Middle VR.</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li>State "WAIT"       from "CURRENT"    <span class="timestamp-wrapper"><span class="timestamp">[2016-04-08 Fri 11:06] </span></span> <br  />
waiting on a response</li>
<li>State "CURRENT"    from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2016-04-08 Fri 11:06] </span></span> <br  />
Send email to sebastien for an updated quote</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nshetty</p>
<p class="date">Created: 2017-04-03 Mon 02:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
